### Bibliotecas

In [2]:
import pandas as pd

### Carregamento de dados

In [3]:
acessos = pd.read_excel('compras_e_acessos.xlsx', sheet_name='acessos')

In [4]:
acessos

   user_id user_name  total
0        8     RENAN     10
1        3  GABRIELA      2
2        5    REBECA    399
3        6     PEDRO     21
4        7     JAMES      1

In [5]:
compras = pd.read_excel('compras_e_acessos.xlsx', sheet_name='compras')

In [6]:
compras

   user_id user_name  total
0        2      JOÃO     78
1        3  GABRIELA    100
2        5    REBECA     22
3        6     PEDRO    332
4        1   MARIANA     13

### Merge sem intersecção

#### SQL LEFT JOIN: Usuários que tem acessos, mas não tenham compras

In [7]:
left_join = acessos.merge(compras, how='left', on='user_id', indicator=True)

In [8]:
left_join

   user_id user_name_x  total_x user_name_y  total_y     _merge
0        8       RENAN       10         NaN      NaN  left_only
1        3    GABRIELA        2    GABRIELA    100.0       both
2        5      REBECA      399      REBECA     22.0       both
3        6       PEDRO       21       PEDRO    332.0       both
4        7       JAMES        1         NaN      NaN  left_only

In [11]:
left_join = left_join[left_join._merge == 'left_only']

In [12]:
left_join

   user_id user_name_x  total_x user_name_y  total_y     _merge
0        8       RENAN       10         NaN      NaN  left_only
4        7       JAMES        1         NaN      NaN  left_only

#### SQL RIGHT JOIN: Usuários que têm compras, mas que não tem acessos

In [27]:
right_join = acessos.merge(compras, how='right', on="user_id", indicator=True)

In [28]:
right_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        2         NaN      NaN        JOÃO       78  right_only
1        3    GABRIELA      2.0    GABRIELA      100        both
2        5      REBECA    399.0      REBECA       22        both
3        6       PEDRO     21.0       PEDRO      332        both
4        1         NaN      NaN     MARIANA       13  right_only

In [29]:
right_join = right_join[right_join._merge == 'right_only']

In [30]:
right_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        2         NaN      NaN        JOÃO       78  right_only
4        1         NaN      NaN     MARIANA       13  right_only

#### SQL FULL JOIN: Usuários que tem acessos OU compras, mas que não tenham os dois ao mesmo tempo

In [31]:
full_join = acessos.merge(compras, how='outer', on='user_id', indicator=True)

In [32]:
full_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        8       RENAN     10.0         NaN      NaN   left_only
1        3    GABRIELA      2.0    GABRIELA    100.0        both
2        5      REBECA    399.0      REBECA     22.0        both
3        6       PEDRO     21.0       PEDRO    332.0        both
4        7       JAMES      1.0         NaN      NaN   left_only
5        2         NaN      NaN        JOÃO     78.0  right_only
6        1         NaN      NaN     MARIANA     13.0  right_only

In [34]:
full_join = full_join[full_join._merge != 'both']

In [35]:
full_join

   user_id user_name_x  total_x user_name_y  total_y      _merge
0        8       RENAN     10.0         NaN      NaN   left_only
4        7       JAMES      1.0         NaN      NaN   left_only
5        2         NaN      NaN        JOÃO     78.0  right_only
6        1         NaN      NaN     MARIANA     13.0  right_only